integration-test/src/test/resources/soap/register-certificate-2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ns1="urn:riv:itintegration:registry:1"
    xmlns:ns5="urn:riv:clinicalprocess:healthcond:certificate:3.2"
    xmlns:ns2="urn:riv:clinicalprocess:healthcond:certificate:3"
    xmlns:ns4="urn:riv:clinicalprocess:healthcond:certificate:types:3"
    xmlns:ns3="urn:riv:clinicalprocess:healthcond:certificate:RegisterCertificateResponder:3">
  <soapenv:Header>
    <ns1:LogicalAddress>WC</ns1:LogicalAddress>
  </soapenv:Header>
  <soapenv:Body>
    <ns3:RegisterCertificate>
      <ns3:intyg>
        <ns2:intygs-id>
          <ns4:root>TSTNMT2321000156-ALMC</ns4:root>
          <ns4:extension>it-register-cert-002</ns4:extension>
        </ns2:intygs-id>
        <ns2:typ>
          <ns4:code>IGRAV</ns4:code>
          <ns4:codeSystem>b64ea353-e8f6-4832-b563-fc7d46f29548</ns4:codeSystem>
          <ns4:displayName>Intyg om graviditet</ns4:displayName>
        </ns2:typ>
        <ns2:version>1.0</ns2:version>
        <ns2:signeringstidpunkt>2024-11-09T07:40:13</ns2:signeringstidpunkt>
        <ns2:skickatTidpunkt>2024-11-09T07:40:13</ns2:skickatTidpunkt>
        <ns2:patient>
          <ns2:person-id>
            <ns4:root>1.2.752.129.2.1.3.1</ns4:root>
            <ns4:extension>190101010101</ns4:extension>
          </ns2:person-id>
          <ns2:fornamn></ns2:fornamn>
          <ns2:efternamn></ns2:efternamn>
          <ns2:postadress></ns2:postadress>
          <ns2:postnummer></ns2:postnummer>
          <ns2:postort></ns2:postort>
        </ns2:patient>
        <ns2:skapadAv>
          <ns2:personal-id>
            <ns4:root>1.2.752.129.2.1.4.1</ns4:root>
            <ns4:extension>TSTNMT2321000156-DRAA</ns4:extension>
          </ns2:personal-id>
          <ns2:fullstandigtNamn>Ajla Doktor</ns2:fullstandigtNamn>
          <ns2:forskrivarkod>0000000</ns2:forskrivarkod>
          <ns2:enhet>
            <ns2:enhets-id>
              <ns4:root>1.2.752.129.2.1.4.1</ns4:root>
              <ns4:extension>TSTNMT2321000156-ALMC</ns4:extension>
            </ns2:enhets-id>
            <ns2:arbetsplatskod>
              <ns4:root>1.2.752.29.4.71</ns4:root>
              <ns4:extension>1234567890</ns4:extension>
            </ns2:arbetsplatskod>
            <ns2:enhetsnamn>Alfa Medicincentrum</ns2:enhetsnamn>
            <ns2:postadress>Storgatan 1</ns2:postadress>
            <ns2:postnummer>12345</ns2:postnummer>
            <ns2:postort>Smamaala</ns2:postort>
            <ns2:telefonnummer>0101234567890</ns2:telefonnummer>
            <ns2:epost>AlfaMC@webcert.invalid.se</ns2:epost>
            <ns2:vardgivare>
              <ns2:vardgivare-id>
                <ns4:root>1.2.752.129.2.1.4.1</ns4:root>
                <ns4:extension>TSTNMT2321000156-ALFA</ns4:extension>
              </ns2:vardgivare-id>
              <ns2:vardgivarnamn>Alfa Regionen</ns2:vardgivarnamn>
            </ns2:vardgivare>
          </ns2:enhet>
        </ns2:skapadAv>
      </ns3:intyg>
    </ns3:RegisterCertificate>
  </soapenv:Body>
</soapenv:Envelope>
